#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 2s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "528950dc2b9b80e965456f1c65663671" -> "5088fecdd2ce1b1c2a579890c254d0d6"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "5414b4d2b33ec86800ebdaaf5e52ca32" -> "1dfadc682c0a0d4079303e788c0e0330"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "7e508288b5a3bec389629814b9d7cddd" -> "8e50102497b61cd2a59d7d86206ef3cb"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "34ce2e6aa65b17c016a0570308d9c65f" -> "44fc3da5e89e42222e3d4d1997f92d2c"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "eda4efade95148e6644b9eceecd044eb" -> "38d2c31b67f3bc306bc243c98ef0149c"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "c22d31323703b7308aae73b99847dd98" -> "0ed78140370c16dc998b8603006b2bd7"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "672de35b183817bfdb92c2e1ca95de90" -> "96f794e4b9f3bd208f904b5b32c510ab"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "18a92d61b9ec3c7d4cf12c28c4386604" -> "1455bc6f4264ea7424bd5fccdfd478be"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "0f5d91acc7fc5553bfbc6e83d6d00e9a" -> "547a9cc4c1b2f7f84093938a47d3da17"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "a3bc51877739d49d2e0157af6f92ba02" -> "8db1a2f92bbc548421aa386cf433488a"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "cb0fd139c64765c41fa593cbfb589d06" -> "91b9766d346b4aa2111c0ba98667a70c"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "ff1d1162fe95e5626d087bb63bc1ce4a" -> "c761503a0a7ba3d864d4e5c8e178debf"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "4e4e6d62c404b064684a9c5011e0de96" -> "19c9294938c132d740d8fa4bda6fdf3b"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "1f4ca343650024ac985816f649a28cc8" -> "b6dd21dae7f5e919a522ecdb71ba7e27"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "0b00dca6f0167479fb915a83f70414a3" -> "cc33b32b2031544d123e87647b5968c1"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "50949069be29b91f17efa33d2ebdb2c1" -> "e692262734c42835c88208fe4043d168"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "8516959b92eaef8d9fd60e4a41ac8443" -> "a46b804c70fc30e2dfb61435e213dbfa"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "5b7dde43f9239429cdfce09e36f4d8d1" -> "d500022bff46eb7c50bb600eda390296"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "024e469dc1dc8b0a867ebff0ef6f4c8a" -> "c56a8686efb0937d3f82932a0069b88c"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "a51907acafec757a5ffeed64f4850503" -> "eed65840d085517ff4acef8e04beb58c"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "5d5017c1bac52e7aa7ce0243d4192225" -> "e8b398a315e6853fd8c768539cf6429a"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "ad7763c850b2b27dcdb8994f4db3c2fd" -> "dcaa4b239047e290876a19fa24d0b065"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "b404d216a96dfa491a8e4460c49aec73" -> "e6410f1084b8049b16357a107e940a37"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "48fc0ad6051631879c8fd147319127fe" -> "cdf6dbc60cde48d23f7a089e96065d2a"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "359feec3596f19966b522080bc65dee2" -> "f907694f66db10763a32ab6b0e80d62e"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "3c47690ce81429ab52941fb6b5da7fb8" -> "a98051e39ab77f9d55925f58a538859a"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "bbc80b386567713ee8cfba112ed0f061" -> "fb831c870e1ac1ed009500c52bbf8bbd"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "da780d1d8903b308ffde2bd04738f783" -> "cd93a26be6bb09db9b92c87e0c638b59"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "5640bc093f9bf7d027ab5b475abc66c2" -> "362ea60f713662f533dc5f2d5122893c"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "5394eba90e8447d6e0654983504a3557" -> "844f5d68fa1aeb4c0cd6ee53a33bd854"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "f23fe6b3f6985ccdfec0c1addfcd9ea8" -> "4c9bbd82bc8d08e89f2007c145b97604"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "0563238b88fe83507e8bd9872a5afd7a" -> "d8dd4d8dcf226a4ef4e80866dee53648"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6f5a3823cb67286822c6dd26520b829f" -> "a3dc71014e248731666fe503f6c8d305"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "0c508ec6183a86e1a58901e907bcb09d" -> "0169fe239ce762ea2883a6aab87605b3"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "f7999e4f441e691847e64be03eb075a2" -> "7d6ff5576e6e21b227357bfe02bae877"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "141c7ab27674b684adc3401299566972" -> "c5f21df12300bc2b020430573d441626"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "ce4790f6e5fecfabb17c305a68b3d0b7" -> "88784050ff5cbe5eb3b1da1dc69f5bcc"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "829984809d89460903c7715164ad1673" -> "cf5be29b996929da094b48364843321b"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "1c0e01df16832636e0cd5067f7a2b59d" -> "e1864dda6d3966336135064bab54505d"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d7d666d53a8f65dde652993c20072fe3" -> "b9206e5f99a2a9f13ffb7101d37319dc"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "0db86a5d1b9b05085884e0c1354490a2" -> "1aaf01fbbc1100b1a9f949a3906259da"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "21efe4d87165698ba05c2051a5fe6f3a" -> "fbe4f4f92ff1a3fa1c6b336969dee0a6"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "1ffa3dc07f762bdac1c65d5b98964629" -> "e3e52f7e8b8b8f69f7630f758e978668"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "b9e44e956d708d16ce4d4bba087e1150" -> "d947cdd3fbecd0aad1e01684c9627f21"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "a4936546b8448dfa79a084ff8d8ec3e2" -> "3ee8dfe1e8ee00ea923eff993aad5552"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogeVPKjLMIE3KVdQTJTAbMQo6BT0KYhk+B1EG0kGiMo=" -> "zmza6QzPCvbbPtwnMp3nZmMQlWqgyV6h++P/nU3x9Rs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "F3KusV6mZYI8ompMTmFtO+JGkV+EFOeccI0rCdkV3k0=" -> "SfhcDi953IEsh/ToALY9Fwtf/PQaUVwblLqorsXGU/4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "7B5tbO6/tUIC4/twEF70iixkSdiamIBmTlv0cnLxnMk=" -> "b9LXvFi/luYMHQaQHy6GCG2P3pSQc6NS/9b+J59jwRw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "7LPqg4P9GhawlmUyxH7renxYL3M1JjzKsYi80LNWFe4=" -> "4aPVvEQZIT1Rv+RPxt7FcIk2k28M7lQooTYti4yVipA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "R/iZtARrKNgciYucsB2ggTKoswEQOFiuA1KppdrKmwQ=" -> "9tCFL/sJI5Hl5gST5WmIN7ulD+kalQr/AzOhrIBr/NY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "wQQ0qGVMveOd/PHRHEZIOPdPbq+JkGRnc6wpV7+Tyf4=" -> "mwrBgre22zRhyf01+Doc8sXZ8GshmAVv8aSw8x0Boac="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "ULHqIETczkJcm/4zwRSWZZuuQirAHmmT5v/0REbvslE=" -> "HtijkzLlCRvQloIYZ43Jb4dPwBh2b5mJeZEs299kBnA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "aDnlveQ/mI4haOIfF78jErUfpTFMOmUegA5AcSYKwsM=" -> "L+2lpFmHJFfQV6+iQd6r3raqNW8mHlx6ckI8KtRXw88="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "/lCyZ5l+m7+EkemcQIfwh/DKszO5YpSLb+2BWM3EPqs=" -> "PKr2ww+lfKIle42Gnge88kuKucsu3dKOfxZLi4T5Wm4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "4NMz21+mmMqFG0BHpM/e6V8B9D1h0sDFOj21PBr6Rjk=" -> "8k1M/n8XjRs0EByGydwVjqYnsTUTGyAUSv0RMPpXC9A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "Zue141fBrmJpKscs8UnCDyccZ8eLfNQ4a5qTGBccy04=" -> "TmKF1GClOtafb/uPYEwOIOXP+ly0lVOm2VR7vnSNyKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "QR02wu1KaKDmiYJ1VB+Ne3oM261QDkecYes7Fv0UQcY=" -> "alhOZlbHlvCh4BOt0PvIQ161gtvZc/ETWlUr65Tv9lI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "QiOJw6KujVgmk0ySmekCqDbfhjGrhvZGR9m0In1TI4Q=" -> "1ki6M7a2GjwsDuRbnRG0qMp/7LGvCPUrSk0+QsfycOI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "eZ8HCKVD8oQ4AnhdAYTpmb9xU1FyFvJm/+/pQ5moUz4=" -> "wN2Wntwpf0yFj643EVWMFE19ZWQBIu5I4DAdmi1i4jQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "QWYc+xPGmPyrqgSwTDg9LIR1qwFXIiAeXfvLP2WoGPg=" -> "pQ4FEhFzMfifYEdiKM1vjRtKpEoojsZ8Y46tsoIecUQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "hb7EABrUBJS3Ica1uJPVFdE01gQ+NTUsJWKg+qKAets=" -> "dIF7LjxWZjX4QGGNAlgx7sxc14Nqm0RlI4QyPfEY+Ik="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "dqYDJn8S4CRDex1AKyiPF6DU0A8FNgyteSDmlHnO3sk=" -> "PsAwkx8yzBagOabvpOdDfZ7LnyArKwSc0MA5PzCgrt4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "kqtVx4UOen/McqfXhEjDqMcT39B1C/LFpK0pXhimMaY=" -> "y680wjGKPvWY4LJ+sg7BRbOhUHG0Ob7YGSf23JkCKKo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "NQ12m2qRajvW2xEJY0XPKTde4AJ30T12dMqOGhCAmko=" -> "l63ZO7UH/MegxfmneItAAqM4LSzqbTP7TSUoazuxqs8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "O5flSgV8Btl8XrGHSVX1shrppdUMnETqfegU1UIQ80I=" -> "vVapENyFfCG5FoMx9QiJkN+DNmw0LLdraVd2mD3REcU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "2WJH0AJ7+lgcEhJlRyZB1JgHa2OrVs3iKsNroaWYoWs=" -> "rzrqs4TXT4h7JEfWN227rZPZuFiYeLdmUF6dXyImqUo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "XjTl6dRYyuQvSCzydBp6dHRnDzW3zIChu3JxffJsIEA=" -> "XgDK4BIOvlL/KTPs/04HpRJUaNQsZTU9UUOYZsdsrEs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "1DRYIo9HrZpz/zuVk2JDjrjEa+xE5HnifTr0Jut06D0=" -> "BTwIuzwdoYu2GxuZJgL9Qsey6ldWKrSD3i/cNWGUJKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "zufX8/+4JEmUJrYD43CaFbI61tZOTOKzFBHQL5C8Mz8=" -> "bMLJ0U/02ANAUNy9Wb0WQzP8H8JXXIPCVw4inw/hMa0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "xuq8UONQ18aXVu0sphlRHxa0S7Uu/iybToAjByzN40w=" -> "3KxPtSMRT78QpSecKl9AWcAed2SeMW/6wQD2Umi+Pmg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr353YdNO2JqkR7HfFCUz2PRcgIYg/nUz9e2GF1Nrsw=" -> "hLKvHVHIRFs2zoayr0y+o9CmhqSpgFHJgQqS7dQqqm8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvhh+qJQF7426aglqpfMSRf+iGUwkp6GTUHNiFi2uhE=" -> "HxYARzYJ89a7pg359ZgAe62pst+oHCBQ3qIAt2ABuZQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "CAuPCjmOWNJxw5uk0V8EavEgujBbxIYvLc6d8BB7t9k=" -> "omgtLT3wsISISJHYZIT/TOuNXntP7iUlXNQV8ZEYUOs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "L5VCUyTAe+6/Zt2fvzwt6wRTPK+8llpu3+YNMyklAbU=" -> "F3wDe+EqWQoemst7il7aaEO9TYCKH8GlFEZCLM/WJqA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "oVQo5fycrXLccPzmAcEUEVnWtVfuDo5Ykbi3GeSHnHc=" -> "1MDQUkpWtVxaehUU+99nvM3VqnbS3V8YdgGME2yGUDo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "1eeNwzwrAFU9/uuV7jpnjwDhtEVLxlWGP9R9+AnZ3T0=" -> "4tqhqSxHY0XAt2pxEO1Z48WyDja9kHEzdLnwrXnBUyE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "Sinf2RwScXPFXizCLcUhaPbBayGVezZqMWKO2fgAOGQ=" -> "SFnrMCyd29t80VUiv4VOdxUbQJlP04LwaNHIUfOgF/o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "ajDeuju9JB163gnGJkkbcxBZa2p/aNN3P1LVChh4Z2E=" -> "Y354gkTwIPF9gX0o3Fdo5l0epAg6DrtrdP++R9VpL5w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "MfsQmywXjDZw3ozGgSzc5dlxaMZ+a63d2+mg5rQzzak=" -> "3muq5zT4YDcBnbEcelDl35jDSZQI+qTEUPOYqjgcSMs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "/BogZEgfy2MnLuXio/HCsH7I+Fxc+VO+QGDpRjzWnHM=" -> "+gl8sHKB1jT9lEfb4BDnk5K/zXKP/VW09BKWVWisR1w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "+ItvU4xCWv1spQioWzBhMh5SxsgbcgndD42ROepXD2k=" -> "zzTu4x/8MtSjE1rzH9ku8vi+vQtgbL2KbWgChgLzcC4="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "uhcw3fCIPvJw2sZZfftkdq1t5jtOHtNCRtGE8iV1oHQ=" -> "rZQ4Voc1xjVw2f2g1Ln8ea94tl4lcuKzHTvNLRhLBZk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "GyVLtf5MmK9M0PggBl/e3/WZ0RVc7eStld8FXK9mnVA=" -> "e/rFJhFMS2dgbWm0NNdLp4nS0wu7deXd2wVE+dvRDNo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "NbvDSgxQxQMWfFN8AB/2NLEgsoIQGxukYaPn+na6O38=" -> "pFFyDSKiRwiKldjytm8R17Tik3NoypVFM4v/OrT4qIQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "SrWnGiK6Ld5PNgXrCp+llwdKdfjFUbjCHtPmU1cevVY=" -> "Pz9pjBbz/slYd3Tjvd6HbWtBMVXbZip57zmge1pMCcY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "7EkBCrL3KqOB1ETLWf60fGHHdTaIkKzJ9Wn4uywfbJU=" -> "j7R1ZH+TtwuPlAbUfh3/pfydrut6mDaVie8Iekjlatk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "fdM2S065xKmnFDQ01K3qkBdFnYBSo1CMa12iBFO00lc=" -> "hEIlCDR52v5vVvIW/iRGe+eb2x0w3XPIrOr4ad2OukM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-11-23T21:21:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "e3cwElhmDW3/CVHUVvECkAhQfUksAP1Ig32CGYnfnHc=" -> "JM0CryF0emi3Bt80JvwuMqdRGSe/8G3H+64LCb2xrSc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-11-23T21:20:18.000+0000" -> (known after apply)
      ~ source_code_hash               = "CV16FEW+mnIvUj7Vs5rbYx+2HvthUDOHj7PllxrTPHQ=" -> "fNlcWhe6ZP1+bKPrCmkYYfqpW72wP4iGYYyRgrgIOqU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-11-23T21:20:16Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "pqeo5a" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-11-23T21:20:15Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-11-23T21:20:15Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*